Конфигурация/DataProcessors/СводноеПогашениеКупона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СводноеПогашениеКупона</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Documents/ПогашениеКупона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеКупона</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличествоЦелое</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигацию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигациюВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупонаВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/СводноеПогашениеКупона/Forms/СозданиеПогашенийКупона/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "Организация, Дата, ДатаФиксации, Облигация, ВалютаОплаты, СуммаНаОднуОблигацию, СуммаНаОднуОблигациюВВалютеОплаты");
	
	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Облигация, "ВалютаНоминала");
	
	Для каждого СтрокаПлановыеПогашения Из ЭтаФорма.Параметры.ПлановыеПогашения Цикл
		
		НоваяСтрокаПогашенияКупона = ПогашенияКупона.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПогашенияКупона, СтрокаПлановыеПогашения);
							
	КонецЦикла;
		
	ТаблицаДанных = РегистрыСведений.НастройкиУчетаДоходовПоЦеннымБумагам.ПолучитьЗначенияНастроекУчетаДоходовПоЦеннымБумагам(РеквизитФормыВЗначение("ПогашенияКупона"), ЭтаФорма.Дата, ЭтаФорма.Организация);
	
	ЗначениеВРеквизитФормы(ТаблицаДанных, "ПогашенияКупона");
	
	Если ВалютаНоминала <> ВалютаОплаты Тогда
		Для каждого Строка Из ПогашенияКупона Цикл
			Строка.СуммаКупонаВВалютеОплаты = Строка.Количество * СуммаНаОднуОблигациюВВалютеОплаты;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьНадписиИЗаголовки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы И Не ЭтаФорма.ПовторноеЗакрытие Тогда
		
		Отказ = Истина;
		
		ЭтаФорма.ПовторноеЗакрытие = Истина;
		
		ЭтаФорма.Закрыть(
			?(ЭтаФорма.СозданныеДокументы.Количество() = 0, Неопределено, ЭтаФорма.СозданныеДокументы.ВыгрузитьЗначения()));
		
	КонецЕсли;    
		
КонецПроцедуры

#КонецОбласти

#Область События_таблицы_формы

&НаКлиенте
Процедура ПогашенияКупонаОплатаЧерезБрокераПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПогашенияКупона.ТекущиеДанные;
	
	Если Не ТекущиеДанные.ОплатаЧерезБрокера Тогда
		ТекущиеДанные.Брокер = Неопределено;
	КонецЕсли;
	
	ПогашенияКупонаБрокерПриИзменении(ТекущиеДанные.ОплатаЧерезБрокера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПогашенияКупонаБрокерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПогашенияКупона.ТекущиеДанные;
	
	ТекущиеДанные.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(
		Новый Структура("Дата, Организация, Брокер", ЭтаФорма.Дата, ЭтаФорма.Организация, ТекущиеДанные.Брокер));
	
	Если Не ТекущиеДанные.ДетализацияПоРасчетномуСчету Тогда
		ТекущиеДанные.РасчетныйСчет = Неопределено;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПогашенияКупонаПриИзменении(Элемент)
	
	ОбновитьНадписиИЗаголовки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПогашенияКупонаКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПогашенияКупона.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СуммаКупона = ТекущиеДанные.Количество * ЭтаФорма.СуммаНаОднуОблигацию;
	
	Если ВалютаНоминала <> ВалютаОплаты Тогда
		ТекущиеДанные.СуммаКупонаВВалютеОплаты = ТекущиеДанные.Количество * СуммаНаОднуОблигациюВВалютеОплаты;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_команды_формы

&НаКлиенте
Процедура КомандаСоздатьДокументы(Команда)
	
	Если СоздатьПогашенияКупонаНаСервере() Тогда
		ВсеДокументыСозданы = ЭтаФорма.СозданныеДокументы.Количество() = ЭтаФорма.ПогашенияКупона.Количество();
		Элементы.ФормаКомандаСоздатьДокументы.Доступность = НЕ ВсеДокументыСозданы;
		ЭтаФорма.ПовторноеЗакрытие = ВсеДокументыСозданы;
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписиИЗаголовки(Форма)
	
	ТекстНадписи = "";
	
	Если Форма.ПогашенияКупона.Количество() > 0 Тогда
		
		ИтогоКоличество       = 0;
		ИтогоКоличествоПоРЕПО = 0;
		ИтогоКоличествоВРЕПО  = 0;
		ИтогоСуммаКупона      = 0;
		
		Для каждого СтрокаПогашенияКупона Из Форма.ПогашенияКупона Цикл
			ИтогоКоличество       = ИтогоКоличество       + СтрокаПогашенияКупона.Количество;
			ИтогоКоличествоПоРЕПО = ИтогоКоличествоПоРЕПО + СтрокаПогашенияКупона.КоличествоПоРЕПО;
			ИтогоКоличествоВРЕПО  = ИтогоКоличествоВРЕПО  + СтрокаПогашенияКупона.КоличествоВРЕПО;
			ИтогоСуммаКупона      = ИтогоСуммаКупона      + СтрокаПогашенияКупона.СуммаКупона;
		КонецЦикла;
		
		ТекстНадписи = "Итого " + ИтогоКоличество + " " + РаботаСКорзинойЦенныхБумагКлиентСервер.ФормаМножественногоЧислаЦеннойБумаги(ИтогоКоличество, ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"))
			+ ?(ИтогоКоличествоПоРЕПО > 0, ", в т.ч. " + ИтогоКоличествоПоРЕПО + " по РЕПО,", "")
			+ ?(ИтогоКоличествоВРЕПО > 0, ", в т.ч. "  + ИтогоКоличествоВРЕПО  + " в РЕПО," , "") + " на сумму " + ИтогоСуммаКупона;
		
	КонецЕсли;
	
	Форма.Элементы.НадписьПогашенияКупонаИтого.Заголовок = ТекстНадписи;
	
	//Обновление заголовков сумм 
	Форма.Элементы.СуммаНаОднуОблигацию.Заголовок					 = "Сумма на одну облигацию в " + Строка(Форма.ВалютаНоминала);
	Форма.Элементы.СуммаНаОднуОблигациюВВалютеОплаты.Заголовок		 = "Сумма на одну облигацию в " + Строка(Форма.ВалютаОплаты);
	Форма.Элементы.ПогашенияКупонаСуммаКупона.Заголовок 			 = "Сумма купона в " + Строка(Форма.ВалютаНоминала);
	Форма.Элементы.ПогашенияКупонаСуммаКупонаВВалютеОплаты.Заголовок = "Сумма купона в " + Строка(Форма.ВалютаОплаты);
	
	//Настройка видимости сумм
	Форма.Элементы.СуммаНаОднуОблигациюВВалютеОплаты.Видимость 		 = (Форма.ВалютаНоминала <> Форма.ВалютаОплаты);
	Форма.Элементы.ПогашенияКупонаСуммаКупонаВВалютеОплаты.Видимость = (Форма.ВалютаНоминала <> Форма.ВалютаОплаты);
	
КонецПроцедуры // ОбновитьНадписиИЗаголовки

&НаСервере
Функция СоздатьПогашенияКупонаНаСервере()
	
	ЕстьОшибки = Ложь;
	
	// проверим заполнение на основе имеющихся данных
	Для НомСтр = 0 По ЭтаФорма.ПогашенияКупона.Количество() - 1 Цикл
		
		СтрокаПогашенияКупона = ЭтаФорма.ПогашенияКупона[НомСтр];
		
		Если СтрокаПогашенияКупона.Количество = 0 Тогда
			Сообщить("Не заполнено поле ""Количество"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаПогашенияКупона.СуммаКупона = 0 Тогда
			Сообщить("Не заполнено поле ""Сумма купона"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаПогашенияКупона.ОплатаЧерезБрокера И Не ЗначениеЗаполнено(СтрокаПогашенияКупона.Брокер) Тогда
			Сообщить("Не заполнено поле ""Брокер"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если СтрокаПогашенияКупона.ДетализацияПоРасчетномуСчету И Не ЗначениеЗаполнено(СтрокаПогашенияКупона.РасчетныйСчет) Тогда
			Сообщить("Не заполнено поле ""Расчетный счет"" в строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// создадим документ
	Для НомСтр = 0 По ЭтаФорма.ПогашенияКупона.Количество() - 1 Цикл
		
		СтрокаПогашенияКупона = ЭтаФорма.ПогашенияКупона[НомСтр];
		
		Если СтрокаПогашенияКупона.ДокументСоздан Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		ПогашениеКупона = Документы.ПогашениеКупона.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(ПогашениеКупона, ЭтаФорма);
		
		ЗаполнитьЗначенияСвойств(ПогашениеКупона, СтрокаПогашенияКупона);
		
		Если НЕ РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ПогашениеКупона) Тогда
			ПогашениеКупона.РасчетныйСчет = Неопределено;
		КонецЕсли;
		
		ПогашениеКупона.Ответственный = РаботаСПользователями.ТекущийПользователь();
	
		Если Не ПогашениеКупона.ПроверитьЗаполнение() Тогда
			Сообщить("Не удалось создать погашение купона по строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецЕсли;
	
		Попытка
			ПогашениеКупона.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ " + ПогашениеКупона);
			ЭтаФорма.СозданныеДокументы.Добавить(ПогашениеКупона.Ссылка);
			СтрокаПогашенияКупона.ДокументСоздан = Истина;
		Исключение
			Сообщить("Не удалось создать погашение купона по строке № " + (НомСтр + 1));
			ЕстьОшибки = Истина;
		КонецПопытки;
	
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции // СоздатьПогашенияКупонаНаСервере

#КонецОбласти
